moved to mermaid diagram instead of ascii
